; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v7 ?v6)
             (pred_9 ?v11 ?v9)
             (pred_11 ?v7 ?v9)
             (pred_5 ?v5 ?v7 )
	     (pred_3 ?v7)
             (pred_4 ?v10)
             (pred_8 ?v11)
             (pred_2 ?v9)
             (pred_12 ?v7)
             (pred_1 ?v11)
             (pred_10 ?v7)
             (pred_6 ))



(:action op_4
:parameters (?v1 ?v3 ?v12 ?v13)
:precondition (and (pred_4 ?v1) (pred_4 ?v3) (pred_8 ?v12) (pred_2 ?v13)
          (pred_7 ?v1 ?v3) (pred_9 ?v12 ?v13)
                   (pred_11 ?v3 ?v13) (pred_3 ?v1) 
                   (pred_12 ?v3) (pred_1 ?v12))
:effect (and  (pred_10 ?v3) (not (pred_12 ?v3))))


(:action op_1
:parameters (?v1 ?v4)
:precondition (and (pred_4 ?v1) (pred_4 ?v4)
               (pred_3 ?v1) (pred_7 ?v1 ?v4) (pred_10 ?v4))
:effect (and (pred_3 ?v4) (not (pred_3 ?v1))))

(:action op_2
:parameters (?v1 ?v12)
:precondition (and (pred_4 ?v1) (pred_8 ?v12) 
                  (pred_3 ?v1) (pred_5 ?v12 ?v1) (pred_6 ))
:effect (and (pred_1 ?v12)
   (not (pred_5 ?v12 ?v1)) (not (pred_6 ))))


(:action op_5
:parameters (?v1 ?v8 ?v2)
:precondition (and (pred_4 ?v1) (pred_8 ?v8) (pred_8 ?v2)
                  (pred_3 ?v1) (pred_1 ?v2) (pred_5 ?v8 ?v1))
:effect (and (pred_1 ?v8) (pred_5 ?v2 ?v1)
        (not (pred_1 ?v2)) (not (pred_5 ?v8 ?v1))))

(:action op_3
:parameters (?v1 ?v12)
:precondition (and (pred_4 ?v1) (pred_8 ?v12) 
                  (pred_3 ?v1) (pred_1 ?v12))
:effect (and (pred_6 ) (pred_5 ?v12 ?v1) (not (pred_1 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_07 obj_18 obj_30 obj_16 obj_26 obj_21 obj_15 obj_10 obj_29 obj_20 obj_04 obj_25 obj_24 obj_13 obj_05 obj_28 obj_22 obj_14 obj_27 obj_12 obj_23 obj_19 obj_02 obj_17
    obj_08 obj_11
    obj_03 obj_06 obj_09
    )

    (:init
       (pred_6)

       (pred_4 obj_01)
       (pred_4 obj_07)
       (pred_4 obj_18)
       (pred_4 obj_30)
       (pred_4 obj_16)
       (pred_4 obj_26)
       (pred_4 obj_21)
       (pred_4 obj_15)
       (pred_4 obj_10)
       (pred_4 obj_29)
       (pred_4 obj_20)
       (pred_4 obj_04)
       (pred_4 obj_25)
       (pred_4 obj_24)
       (pred_4 obj_13)
       (pred_4 obj_05)
       (pred_4 obj_28)
       (pred_4 obj_22)
       (pred_4 obj_14)
       (pred_4 obj_27)
       (pred_4 obj_12)
       (pred_4 obj_23)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_17)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_8 obj_09)

       (pred_7 obj_01 obj_26)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_07 obj_18)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_18 obj_15)
       (pred_7 obj_18 obj_30)
       (pred_7 obj_18 obj_07)
       (pred_7 obj_30 obj_10)
       (pred_7 obj_30 obj_16)
       (pred_7 obj_30 obj_18)
       (pred_7 obj_16 obj_29)
       (pred_7 obj_16 obj_30)
       (pred_7 obj_26 obj_20)
       (pred_7 obj_26 obj_21)
       (pred_7 obj_26 obj_01)
       (pred_7 obj_21 obj_04)
       (pred_7 obj_21 obj_15)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_21 obj_26)
       (pred_7 obj_15 obj_25)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_15 obj_18)
       (pred_7 obj_15 obj_21)
       (pred_7 obj_10 obj_24)
       (pred_7 obj_10 obj_29)
       (pred_7 obj_10 obj_30)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_29 obj_13)
       (pred_7 obj_29 obj_16)
       (pred_7 obj_29 obj_10)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_20 obj_26)
       (pred_7 obj_04 obj_28)
       (pred_7 obj_04 obj_25)
       (pred_7 obj_04 obj_21)
       (pred_7 obj_04 obj_20)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_25 obj_24)
       (pred_7 obj_25 obj_15)
       (pred_7 obj_25 obj_04)
       (pred_7 obj_24 obj_14)
       (pred_7 obj_24 obj_13)
       (pred_7 obj_24 obj_10)
       (pred_7 obj_24 obj_25)
       (pred_7 obj_13 obj_27)
       (pred_7 obj_13 obj_29)
       (pred_7 obj_13 obj_24)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_05 obj_28)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_28 obj_23)
       (pred_7 obj_28 obj_22)
       (pred_7 obj_28 obj_04)
       (pred_7 obj_28 obj_05)
       (pred_7 obj_22 obj_19)
       (pred_7 obj_22 obj_14)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_22 obj_28)
       (pred_7 obj_14 obj_02)
       (pred_7 obj_14 obj_27)
       (pred_7 obj_14 obj_24)
       (pred_7 obj_14 obj_22)
       (pred_7 obj_27 obj_17)
       (pred_7 obj_27 obj_13)
       (pred_7 obj_27 obj_14)
       (pred_7 obj_12 obj_23)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_23 obj_19)
       (pred_7 obj_23 obj_28)
       (pred_7 obj_23 obj_12)
       (pred_7 obj_19 obj_02)
       (pred_7 obj_19 obj_22)
       (pred_7 obj_19 obj_23)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_02 obj_14)
       (pred_7 obj_02 obj_19)
       (pred_7 obj_17 obj_27)
       (pred_7 obj_17 obj_02)
       (pred_12 obj_17)
       (pred_12 obj_20)
       (pred_12 obj_05)
       (pred_11  obj_17 obj_08)
       (pred_11  obj_20 obj_11)
       (pred_11  obj_05 obj_08)
       (pred_10 obj_01)
       (pred_10 obj_07)
       (pred_10 obj_18)
       (pred_10 obj_30)
       (pred_10 obj_16)
       (pred_10 obj_26)
       (pred_10 obj_21)
       (pred_10 obj_15)
       (pred_10 obj_10)
       (pred_10 obj_29)
       (pred_10 obj_04)
       (pred_10 obj_25)
       (pred_10 obj_24)
       (pred_10 obj_13)
       (pred_10 obj_28)
       (pred_10 obj_22)
       (pred_10 obj_14)
       (pred_10 obj_27)
       (pred_10 obj_12)
       (pred_10 obj_23)
       (pred_10 obj_19)
       (pred_10 obj_02)

       (pred_9  obj_03 obj_08)
       (pred_9  obj_06 obj_11)
       (pred_9  obj_09 obj_08)
       (pred_5 obj_03 obj_16)
       (pred_5 obj_06 obj_22)
       (pred_5 obj_09 obj_18)
       (pred_3 obj_26)
    )

    (:goal (and
       (pred_5 obj_09 obj_13)
    ))
(:constraints
  (always (not (pred_3 obj_15)))
)
)

; plan
1. (op_1 obj_26 obj_21)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_21)
   goals met: 0 of 1
2. (op_1 obj_21 obj_07)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_07)
   goals met: 0 of 1
3. (op_1 obj_07 obj_18)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_18)
   goals met: 0 of 1
4. (op_2 obj_18 obj_09)
   deleted: (pred_5 obj_09 obj_18) (pred_6)
   added: (pred_1 obj_09)
   goals met: 0 of 1
5. (op_1 obj_18 obj_30)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_30)
   goals met: 0 of 1
6. (op_1 obj_30 obj_16)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_16)
   goals met: 0 of 1
7. (op_1 obj_16 obj_29)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_29)
   goals met: 0 of 1
8. (op_1 obj_29 obj_13)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_13)
   goals met: 0 of 1
9. (op_3 obj_13 obj_09)
   deleted: (pred_1 obj_09)
   added: (pred_6) (pred_5 obj_09 obj_13)
   goals met: 1 of 1
